zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100smax_64_tqfp.h
    /* P1.3 */
    P1_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_3_MSC0_SENSE                 =  4,       /* msc[0].sense:3 */
    P1_3_MSC0_SHIELD                =  5,       /* msc[0].shield:3 */
    P1_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_3_TCPWM_LINE_COMPL3          =  8,       /* Digital Active - tcpwm.line_compl[3]:1 */
    P1_3_SCB0_UART_RTS              =  9,       /* Digital Active - scb[0].uart_rts:1 */
    P1_3_PASS0_DSI_SAR_DATA4        = 10,       /* Digital Active - pass[0].dsi_sar_data[4]:0 */
    P1_3_TCPWM_TR_IN3               = 11,       /* Digital Active - tcpwm.tr_in[3] */
    P1_3_LCD_COM11                  = 12,       /* Digital Deep Sleep - lcd.com[11] */
    P1_3_LCD_SEG11                  = 13,       /* Digital Deep Sleep - lcd.seg[11] */
    P1_3_SCB2_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[2].i2c_sda:2 */
    P1_3_SCB0_SPI_SELECT0           = 15,       /* Digital Deep Sleep - scb[0].spi_select0:1 */

    /* P1.4 */
    P1_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_4_MSC0_SENSE                 =  4,       /* msc[0].sense:4 */
    P1_4_MSC0_SHIELD                =  5,       /* msc[0].shield:4 */
    P1_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_4_TCPWM_LINE6                =  8,       /* Digital Active - tcpwm.line[6]:1 */
    P1_4_MSC1_OBS_DATA0             = 10,       /* Digital Active - msc[1].obs_data[0] */
    P1_4_LCD_COM12                  = 12,       /* Digital Deep Sleep - lcd.com[12] */
    P1_4_LCD_SEG12                  = 13,       /* Digital Deep Sleep - lcd.seg[12] */
    P1_4_SCB3_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[3].i2c_scl:0 */
    P1_4_SCB0_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[0].spi_select1:1 */

    /* P1.5 */
    P1_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_5_MSC0_SENSE                 =  4,       /* msc[0].sense:5 */
    P1_5_MSC0_SHIELD                =  5,       /* msc[0].shield:5 */
    P1_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_5_TCPWM_LINE_COMPL6          =  8,       /* Digital Active - tcpwm.line_compl[6]:1 */
    P1_5_MSC1_OBS_DATA1             = 10,       /* Digital Active - msc[1].obs_data[1] */
    P1_5_LCD_COM13                  = 12,       /* Digital Deep Sleep - lcd.com[13] */
    P1_5_LCD_SEG13                  = 13,       /* Digital Deep Sleep - lcd.seg[13] */
    P1_5_SCB3_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[3].i2c_sda:0 */
    P1_5_SCB0_SPI_SELECT2           = 15,       /* Digital Deep Sleep - scb[0].spi_select2:1 */

    /* P1.6 */
    P1_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_6_MSC0_SENSE                 =  4,       /* msc[0].sense:6 */
    P1_6_MSC0_SHIELD                =  5,       /* msc[0].shield:6 */
    P1_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_6_TCPWM_LINE7                =  8,       /* Digital Active - tcpwm.line[7]:1 */
    P1_6_MSC1_OBS_DATA2             = 10,       /* Digital Active - msc[1].obs_data[2] */
    P1_6_LCD_COM14                  = 12,       /* Digital Deep Sleep - lcd.com[14] */
    P1_6_LCD_SEG14                  = 13,       /* Digital Deep Sleep - lcd.seg[14] */
    P1_6_SCB0_SPI_SELECT3           = 15,       /* Digital Deep Sleep - scb[0].spi_select3:1 */

    /* P1.7 */
    P1_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_7_MSC0_SENSE                 =  4,       /* msc[0].sense:7 */
    P1_7_MSC0_SHIELD                =  5,       /* msc[0].shield:7 */
    P1_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_7_TCPWM_LINE_COMPL7          =  8,       /* Digital Active - tcpwm.line_compl[7]:1 */
    P1_7_MSC1_OBS_DATA3             = 10,       /* Digital Active - msc[1].obs_data[3] */
    P1_7_LCD_COM15                  = 12,       /* Digital Deep Sleep - lcd.com[15] */
    P1_7_LCD_SEG15                  = 13,       /* Digital Deep Sleep - lcd.seg[15] */
    P1_7_SCB2_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[2].spi_clk:1 */

    /* P2.0 */
    P2_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_0_MSC0_SENSE                 =  4,       /* msc[0].sense:8 */
    P2_0_MSC0_SHIELD                =  5,       /* msc[0].shield:8 */
    P2_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_0_TCPWM_LINE4                =  8,       /* Digital Active - tcpwm.line[4]:0 */
    P2_0_TCPWM_TR_IN4               = 11,       /* Digital Active - tcpwm.tr_in[4] */
    P2_0_LCD_COM16                  = 12,       /* Digital Deep Sleep - lcd.com[16] */
    P2_0_LCD_SEG16                  = 13,       /* Digital Deep Sleep - lcd.seg[16] */
    P2_0_SCB1_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[1].i2c_scl:1 */
    P2_0_SCB1_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[1].spi_mosi:2 */

    /* P2.1 */
    P2_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_1_MSC0_SENSE                 =  4,       /* msc[0].sense:9 */
    P2_1_MSC0_SHIELD                =  5,       /* msc[0].shield:9 */
    P2_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_1_TCPWM_LINE_COMPL4          =  8,       /* Digital Active - tcpwm.line_compl[4]:0 */
    P2_1_TCPWM_TR_IN5               = 11,       /* Digital Active - tcpwm.tr_in[5] */
    P2_1_LCD_COM17                  = 12,       /* Digital Deep Sleep - lcd.com[17] */
    P2_1_LCD_SEG17                  = 13,       /* Digital Deep Sleep - lcd.seg[17] */
    P2_1_SCB1_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[1].i2c_sda:1 */
    P2_1_SCB1_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[1].spi_miso:2 */

    /* P2.2 */
    P2_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_2_MSC0_SENSE                 =  4,       /* msc[0].sense:10 */
    P2_2_MSC0_SHIELD                =  5,       /* msc[0].shield:10 */
    P2_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_2_TCPWM_LINE5                =  8,       /* Digital Active - tcpwm.line[5]:1 */
    P2_2_MSC0_OBS_DATA0             = 10,       /* Digital Active - msc[0].obs_data[0] */
    P2_2_LCD_COM18                  = 12,       /* Digital Deep Sleep - lcd.com[18] */
    P2_2_LCD_SEG18                  = 13,       /* Digital Deep Sleep - lcd.seg[18] */
    P2_2_SCB1_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[1].spi_clk:2 */

    /* P2.3 */
    P2_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_3_MSC0_SENSE                 =  4,       /* msc[0].sense:11 */
    P2_3_MSC0_SHIELD                =  5,       /* msc[0].shield:11 */
    P2_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_3_TCPWM_LINE_COMPL5          =  8,       /* Digital Active - tcpwm.line_compl[5]:1 */
    P2_3_MSC0_OBS_DATA1             = 10,       /* Digital Active - msc[0].obs_data[1] */
    P2_3_LCD_COM19                  = 12,       /* Digital Deep Sleep - lcd.com[19] */
    P2_3_LCD_SEG19                  = 13,       /* Digital Deep Sleep - lcd.seg[19] */
    P2_3_SCB1_SPI_SELECT0           = 15,       /* Digital Deep Sleep - scb[1].spi_select0:2 */

    /* P2.4 */
    P2_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_4_MSC0_SENSE                 =  4,       /* msc[0].sense:12 */
    P2_4_MSC0_SHIELD                =  5,       /* msc[0].shield:12 */
    P2_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_4_TCPWM_LINE0                =  8,       /* Digital Active - tcpwm.line[0]:1 */
    P2_4_SCB3_UART_RX               =  9,       /* Digital Active - scb[3].uart_rx:1 */
    P2_4_MSC0_OBS_DATA2             = 10,       /* Digital Active - msc[0].obs_data[2] */
    P2_4_AUDIOSS_TX_SCK             = 11,       /* Digital Active - audioss.tx_sck:1 */
    P2_4_AUDIOSS0_TX_SCK            = 11,       /* Digital Active - audioss[0].tx_sck:1:0 */
    P2_4_LCD_COM20                  = 12,       /* Digital Deep Sleep - lcd.com[20] */
    P2_4_LCD_SEG20                  = 13,       /* Digital Deep Sleep - lcd.seg[20] */
    P2_4_SCB1_SPI_SELECT1           = 15,       /* Digital Deep Sleep - scb[1].spi_select1:1 */

    /* P2.5 */
    P2_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P2_5_MSC0_SENSE                 =  4,       /* msc[0].sense:13 */
    P2_5_MSC0_SHIELD                =  5,       /* msc[0].shield:13 */
    P2_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P2_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P2_5_TCPWM_LINE_COMPL0          =  8,       /* Digital Active - tcpwm.line_compl[0]:1 */
    P2_5_SCB3_UART_TX               =  9,       /* Digital Active - scb[3].uart_tx:1 */
    P2_5_MSC0_OBS_DATA3             = 10,       /* Digital Active - msc[0].obs_data[3] */
    P2_5_AUDIOSS_TX_WS              = 11,       /* Digital Active - audioss.tx_ws:1 */
    P2_5_AUDIOSS0_TX_WS             = 11,       /* Digital Active - audioss[0].tx_ws:1:0 */
    P2_5_LCD_COM21                  = 12,       /* Digital Deep Sleep - lcd.com[21] */
    P2_5_LCD_SEG21                  = 13,       /* Digital Deep Sleep - lcd.seg[21] */
    P2_5_SCB1_SPI_SELECT2           = 15,       /* Digital Deep Sleep - scb[1].spi_select2:1 */

